ana001_interFoam/run/system/extrudeMeshDict
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    extrudeMeshDict;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
constructFrom    patch;
sourceCase    ".";
flipNormals    false;
mergeFaces    false;
sourcePatches    (empty1_wall_2-4_3);
exposedPatchName empty2_wall_2-4_3;
nLayers    1;
expansionRatio    1;
mergeTol    0;
extrudeModel    linearNormal;
linearNormalCoeffs
{
	thickness    1;
}

