ana001_interFoam/run/constant/hRef
FoamFile
{
	version    2.0;
	format    ascii;
	class    uniformDimensionedScalarField;
	object    hRef;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dimensions    [0 1 0 0 0 0 0];
value    0;
