ana001_interFoam/run/constant/transportProperties
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    transportProperties;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
phases    (liquid air);
liquid
{
	transportModel    Newtonian;
	rho    1000.0;
	nu    1e-6;
}

air
{
	transportModel    Newtonian;
	rho    1.0;
	nu    1.5e-5;
}

sigma    0.07;
