ana001_interFoam/run/system/fvSchemes
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    fvSchemes;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ddtSchemes
{
	default    Euler;
}

geometry
{
	type    highAspectRatio;
	minAspect    10;
	maxAspect    100;
}

gradSchemes
{
	default    Gauss linear;
	grad(p_rgh)    cellLimited<Venkatakrishnan> Gauss linear 1;
	grad(U)    cellLimited<Venkatakrishnan> Gauss linear 1;
	grad(turb)    cellLimited<Venkatakrishnan> Gauss linear 1;
	grad(k)    cellLimited<Venkatakrishnan> Gauss linear 1;
	grad(omega)    cellLimited<Venkatakrishnan> Gauss linear 1;
	grad(alpha)    Gauss linear;
}

divSchemes
{
	default    Gauss linear;
	div(rhoPhi,U)    Gauss linearUpwind grad(U);
	div(phi,k)    Gauss upwind;
	div(phi,omega)    Gauss upwind;
	div(phi,alpha)    Gauss vanLeer;
	div(phirb,alpha)    Gauss linear;
	div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
	default    Gauss linear limited corrected 0.333;
}

interpolationSchemes
{
	default    linear;
}

snGradSchemes
{
	default    limited 0.333;
}

wallDist
{
	method    meshWave;
}

